perf/tests/section-2/load_testing.yaml
config:
  environments:
    server1:
      target: 'http://localhost:9090/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "server1"
    server2:
      target: 'http://localhost:9091/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "server2"

  pool: 50

  phases:
    - name: Plain
      duration: 20
      arrivalRate: 0
    - name: Plain
      duration: 60
      arrivalRate: 10
    - name: Plain
      duration: 20
      arrivalRate: 0

scenarios:
  - name: load testing 1 (/)
    flow:
      - get:
          url: '/'