perf/tests/section-2/server_2_ramp_2.yaml
config:
  environments:
    server1:
      target: 'http://localhost:9090/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "server1-prueba"
    server2:
      target: 'http://localhost:9091/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "server2-prueba"

  pool: 1000

  phases:
    - name: Plain
      duration: 10
      arrivalRate: 0
    - name: Plain
      duration: 120
      arrivalRate: 10
      rampTo: 50
    - name: Plain
      duration: 10
      arrivalRate: 0

scenarios:
  - name: load testing 1 (/)
    flow:
      - loop:
        - get:
            url: '/'
        count: 80